posts/2022-03-13-hobby-project/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Having a Hobby Project</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Having a Hobby Project</h1>
</header><p>
It has been two years since I have started to work on my hobby project
<a href="https://github.com/fwinkelbauer/chunkyard">Chunkyard</a>. Over these years I have used this project to test out different ideas
and concepts, which is something that you cannot always do in a professional
environment. This post highlights a few topics which I have explored.
</p>

<div id="outline-container-ambitions" class="outline-2">
<h2 id="ambitions"><a href="#ambitions">Ambitions</a></h2>
<div class="outline-text-2" id="text-ambitions">
<p>
My initial plans were to create some sort of general purpose library (hah!) that
I could use to implement different types of applications such as a version
control system, a backup tool or some sort of application installer/updater. But
reality is messy and so I had to abandon those plans rather quickly. Creating a
content-addressable storage with or without encryption comes with its own set of
pitfalls, which makes it hard to come up with a general solution. So instead of
a library I settled for the application that I wanted to build.
</p>
</div>
</div>

<div id="outline-container-tests" class="outline-2">
<h2 id="tests"><a href="#tests">Tests</a></h2>
<div class="outline-text-2" id="text-tests">
<p>
A backup tool must be reliable. You don't want to end up in a situation where a
bug breaks your data. All my backups are done using Chunkyard, so preventing
mistakes is something that is important to me in more than one way. While I
cannot ensure that the code base is free of bugs, I have come up with a testing
suite that gives me enough confidence to explore ideas or implement features.
</p>
</div>
</div>

<div id="outline-container-design" class="outline-2">
<h2 id="design"><a href="#design">Design</a></h2>
<div class="outline-text-2" id="text-design">
<p>
Since I do not have any "real" users (besides myself), I can test out all sorts
of designs without having to consider backwards compatibility. Re-reading older
posts such as <a href="../2020-10-03-chunkyard-explained">Chunkyard Explained</a> makes me laugh, because the serialized data
format has changed more than once since I have written that post.
</p>

<p>
Chunkyard was the first project in which I have developed a makefile-style build
tool in C#. Some of my work colleagues liked the idea and we ported the concept
to one our own projects.
</p>
</div>
</div>

<div id="outline-container-performance" class="outline-2">
<h2 id="performance"><a href="#performance">Performance</a></h2>
<div class="outline-text-2" id="text-performance">
<p>
I have no deep understanding of how a computer actually works. Don't get me
wrong, Chunkyard is not slow, but listening to people such as Martin Thompson
makes you wonder how much resources you are wasting for non-essential work. His
conference talks motivated me to write a lock-free ring buffer which is still an
experimental feature for creating backups. Measuring is not always easy since
antivirus software, the actual hardware and some OS-internal caching magic makes
it hard to get meaningful data.
</p>
</div>
</div>

<div id="outline-container-future-work" class="outline-2">
<h2 id="future-work"><a href="#future-work">Future Work</a></h2>
<div class="outline-text-2" id="text-future-work">
<ul class="org-ul">
<li>Figure out how to use <a href="https://fscheck.github.io/FsCheck/">FsCheck</a></li>
<li>Learn to utilize a profiler to find bottlenecks</li>
<li>Try to replace <a href="https://github.com/commandlineparser/commandline">commandlineparser</a> with <a href="https://github.com/dotnet/command-line-api">System.CommandLine</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2022-03-13</p>
<footer>
<p>© 2026 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
